Torvalds2.0: Patricia Torvalds 谈“计算”，大学，女权主义和科技界的多元化
![Image by : Photo by Becky Svartström. Modified by Opensource.com. CC BY-SA 4.0](http://opensource.com/sites/default/files/styles/image-full-size/public/images/life/osdc-lead-patriciatorvalds.png)
Image by : Photo by Becky S. Modified by Opensource.com. [CC BY-SA 4.0][1]
图片来源：照片来自Becky Svartström, 修改自Opensource.com.
Patricia Torvalds 并不是那个在 Linux 和开源领域非常有名同样叫做 Torvalds 的人。
![](http://opensource.com/sites/default/files/images/life-uploads/ptorvalds.png)
18岁的时候，Patricia 已经是一个有多项科技成就并且拥有开源产业经验的女权主义者。紧接着，她把目光投入到在杜克大学地球科学学院工程学第一学年的学习中，以实习生的身份在位于美国奥勒冈州伯特兰市的 Puppet 实验室工作。但不久后，她又直接去了北卡罗纳州的达拉莫，开始秋季学期的大学学习。
在这次独家采访中，Patricia 表示，使她对计算机科学和工程学感兴趣的（剧透警告：不是她的父亲）原因，包括高中时候对科技的偏爱，女权主义在她的生活中扮演了重要角色以及对科技多元化缺乏的思考。
![](http://opensource.com/sites/default/files/images/life/Interview%20banner%20Q%26A.png)
###什么东西使你钟情于学习计算机科学和工程学？###
我在科技方面的兴趣的确产生于高中时代。我曾一度想投身于生物学，直到大约大学二年级的时候。大二结束以后，我在波特兰 VA 当网页设计实习生。与此同时，我参加了一个叫做“风险勘探”的工程学课程，在我大二学年的后期，我们把一个水下机器人送到了太平洋。但是，转折点大概是在青年时代的中期当我因被授予“NCWIT Aspiration in Computing"奖而被称作地区和民族英雄的时候出现的。
这个奖项的获得我感觉确立了自己的兴趣。当然，我认为最重要的部分是我加入到一个所有获奖者在里面的 Facebook 群，里面那些已经获奖的女孩们简直难以置信的相互支持。由于在 XV 和 VA
的工作，我在获奖前就已经确定了致力于计算机科学，但是和这些女孩的交谈更加坚定了这份兴趣，使之更加强壮。再后来，初高年级后期的时候教授 XV 也使我体会到工程学和计算机科学对我来说的确很有趣。
###你打算学习什么？毕业以后你已经知道自己想干什么了吗？###
我希望主修力学或电气科学以及计算机工程学和计算机科学还有女性学。毕业以后，我希望在一个支持或者创造科技为社会造福的公司工作，或者自己开公司。
###我的女儿在高中有一门 Visual Basic的编程课。她是整个班上唯一的一个女生，并且以疲倦和痛苦的经历结束这门课程。你的经历是什么样的呢？###
我的高中在高年级的时候开设计算机科学的课程，我也学习了 Visual Basic！这门课不是很糟糕，但我的确是20多个人的班级里唯一的三四个女生之一。其他的计算机课程似乎也有相似的性别比例差异。然而，我所在的高中极其小并且老师对科技非常支持和包容，所以我并没有感到厌倦。希望在未来的一些年里计算机方面的课程会变得更加多样化。
###你的学校做了哪些促进科技的智举？它们如何能够变得更好？###
我的高中学校给了我们长时间的机会接触到计算机，老师们会突然在不相关的课程上安排科技基础任务，比如有好多次任务，我们必须建一个供社会学习课程使用的网站，我认为这很棒因为它使我们每一个人都能接触到科技。机器人俱乐部也很活跃并且资金充足，但是非常小，我不是其中的成员。学校的科技/工程学项目中一个非常强大的组成部分是一门叫做”风险勘测“的学生教学工程学课程，这是一门需要亲自动手的课程，并且每年处理一个工程学或者计算机科学难题。我和我的一个同学在这儿教授了两年，在课程结束以后，有学生上来告诉我他们对从事工程学或者计算机科学感兴趣。
然而，我的高中没有特别的关注于让年轻女性加入到这些项目中来，并且在人种上也没有呈现多样化。计算机课程和俱乐部大量的主要成员都是男性白人。这的确应该能够有所改善。
###在成长过程中，你如何在家使用科技？###
老实说，小的时候，我使用电脑（我的父亲设了一个跟踪装置，当我们上网一个小时就会断线）玩尼奥宠物和或者相似的游戏。我想我本可以毁坏跟踪装置或者在不连接网络的情况下玩游戏，但我没有这样做。我有时候也会和我的父亲做一些小的科学项目，我还记得我和他在电脑终端上打印出”Hello world"无数次。但是大多数时候，我都是和我的妹妹一起玩网络游戏，直到高中的时候才开始学习“计算”。
###你在高中学校的女权俱乐部很积极，从这份经历中你学到了什么？现在对你来说什么女权问题是最重要的？###
在高中二年级的后期，我和我的朋友一起建立了女权俱乐部。刚开始，我们受到了很多反对和抵抗，并且这从来就没有完全消失过。到我们毕业的时候，女权主义理想已经彻底成为了学校文化的一个部分。我们在学校做的女权主义工作通常是以一些比较直接的方式并集中于像着装要求这样一些问题。
就我个人来说，我更集中于交叉地带的女权主义，把女权主义运用到缓解其他方面的压迫比如种族歧视和阶级歧视。Facebook 网页《Gurrilla Feminism》是交叉地带女权主义一个非常好的例子并且我从中学到了很多。我目前管理波特兰分支。
在科技多样性方面女权主义对我也非常重要，尽管作为一名和科技世界有很强联系的上流社会女性，女权主义问题对我产生的影响相比其他人来说非常少，我所涉及的交叉地带女权主义也是同样的。出版集团比如《Model View Culture》非常鼓舞我，并且我很感激 Shanley Kane 所做的一切。
###你会给想教他们的孩子学习编程的父母什么样的建议？###
老实说，从没有人把我推向计算机科学或者工程学。正如我前面说的，在很长一段时间里，我想成为一名遗传学家。大二结束的那个夏天，我在 VA 当了一个夏季的网页设计实习生，这彻底改变了我之前的想法。所以我不知道我是否能够完整的回答这个问题。
我的确认为真实的兴趣很重要。如果在我12岁的时候，我的父亲让我坐在一台电脑前，教我安装网站服务器，我认为我不会对计算机科学感兴趣。相反，我的父母给了我很多可以支配的自由让我去做自己想做的事情，绝大多数时候是为我的尼奥宠物游戏编糟糕的HTML网站。比我小的妹妹们没有一个对工程学或计算机科学感兴趣，我的父母也不在乎。我感到很幸运的是我的父母给了我和我的妹妹们鼓励和资源去探索自己的兴趣。
仍然，在我成长过程中我也常说未来要和我的父亲做同样的职业，尽管我还不知道我父亲是干什么的，只知道他有一个很酷的工作。另外，中学的时候有一次，我告诉我的父亲这件事，然后他没有发表什么看法只是告诉我高中的时候不要想这事。所以我猜想这从一定程度上刺激了我。
###对于开源社区的领导者们，你有什么建议给他们来吸引和维持更加多元化的贡献者？###
我实际上在开源社区不是特别积极和活跃。和女性讨论“计算”我感觉更舒服。我是“NCWIT Aspirarion in Computing"网站的一名成员，这是我对科技有持久兴趣的一个重要方面，同样也包括Facebook群”Ladies Storm Hackathons".
我认为对于吸引和维持多种多样有天赋的贡献者，安全空间很重要。我过去看到在一些开源社区有人发表关于女性歧视和种族主义的评论，人们指出这一问题随后该人被解职。我认为要维持一个专业的社区必须就骚扰事件和不正当行为有一个很高的标准。当然，人们已经有或者将有很多的选择关于在开源社区或其他任何社区能够表达什么。然而，如果社区领导人真的想吸引和维持多元化有天赋的人员，他们必须创造一个安全的空间并且把社区成员维持在很高的标准上。我也认为一些一些社区领导者不明白多元化的价值。很容易说明科技象征着精英社会，并且很多人被科技忽视的原因是他们不感兴趣，这一问题在很早的准备过程中就提出了。他们争论如果一个人在自己的工作上做得很好，那么他的性别或者民族还有性取向这些情况都变得不重要了。这很容易反驳，但我不想为错误找理由。我认为多元化缺失是一个错误，我们应该为之负责并尽力去改善这件事。
--------------------------------------------------------------------------------

via: http://opensource.com/life/15/8/patricia-torvalds-interview

作者：[Rikki Endsley][a]
译者：[ucasFL](https://github.com/ucasFL)
校对：[校对者ID](https://github.com/校对者ID)
本文由 [LCTT](https://github.com/LCTT/TranslateProject) 原创翻译，[Linux中国](https://linux.cn/) 荣誉推出

[a]:http://opensource.com/users/rikki-endsley
[1]:https://creativecommons.org/licenses/by-sa/4.0/
[2]:https://puppetlabs.com/
[3]:https://www.aspirations.org/
[4]:https://www.facebook.com/guerrillafeminism
[5]:https://modelviewculture.com/
[6]:https://www.aspirations.org/
[7]:https://www.facebook.com/groups/LadiesStormHackathons/
